{
    "rooms": {
        "1": {
            "Memory Hotel": {
                "solution": {
                    "text": "There are five buttons which you must press in order. \n\nLeft bottom, back right, street, tower, left middle, front-left bottom.",
                    "image": "solution.png"
                },
                "in order": {
                    "text": "As the story is being told, one light will turn on per location. Watch for them. They must be pressed in order, and ensure that when you hold the button down, it turns red before you proceed."
                }
            },
            "Spinning Lamp": {
                "spin the lamp": {
                    "text": "The lamp on the wall must be spun until it turns off.",
                    "image": "spin.png"
                },
                "was not on before": {
                    "text": "That bulky lamp on the wall wasn't on before."
                }
            },
            "Weight Game": {
                "order them by weight": {
                    "text": "Order the bottles on the table by weight.",
                    "image": "weight order.png"
                },
                "they go here": {
                    "text": "The bottles belong on this desk here. Notice that some seem to be quite a bit heavier than others.",
                    "image": "bottles on puzzle.png"
                }
            },
            "Computer": {
                "click the icon": {
                    "text": "Double click the icon on the computer to view the security cameras. You'll find the relevant information inside the vault.",
                    "image": "cameras app click.png"
                }
            },
            "Plant Bombs": {
                "solution": {
                    "text": "The bombs go in these positions in these orientations",
                    "image": "c4 positions.png"
                },
                "use clipboard": {
                    "text": "The clipboard shows the location for the C4 packages. Follow the rotation and location precisely to activate them."
                }
            },
            "Buzzwire": {
                "operation": {
                    "text": "Ever played \"Operation\"? Keep the buzzer away from the metal pipes and try to get it to the end. If the light turns red you must go all the way back to restart it.",
                    "image": "buzzwire instructions.png"
                },
                "fast then slow": {
                    "text": "The system resets every five seconds. You can make four errors before the alarm goes off. Go fast and hard but stop just before it alarms and just wait five seconds to refresh your chances.",
                    "image": "buzzwire instructions.png"
                }
            },
            "Clocks": {
                "letters": {
                    "text": "The clocks on the wall are forming letters, four of them to be specific. It will tell you what you should look for in the room."
                },
                "look for this symbol": {
                    "text": "The clocks say \"MOON\". This symbol appears somewhere in the room.",
                    "image": "moon symbol.png"
                },
                "hidden drawer location": {
                    "text": "",
                    "image": "ghgfjdfjfdk.png"
                }
            },
            "Sliding Shelf": {
                "need trophies": {
                    "text": "That shelf is going to need three trophies placed upon it before you find this vault.",
                    "image": "3 trophies.png"
                }
            },
            "Drawers": {
                "line it up": {
                    "text": "The drawers have numbers on their fronts. There are also numbers inside. It's a giant combination lock: line up the drawers inner numbers according to their top outer numbers.",
                    "image": "drawer.png"
                }
            },
            "Case Code": {
                "where to get it": {
                    "text": "If you need a code for that keypad, I'd start with that computer. It's going to ask you for some information and you can definitely find it in the vault.",
                    "image": "keypad.png"
                }
            },
            "Painting 1": {
                "put pieces on the pictures": {
                    "text": "Those pieces you found in the drawer match the paintings on the walls. Line them up accordingly to proceed.",
                    "image": "wave 1 piece.png"
                },
                "solution": {
                    "text": "Two pieces go onto the ocean painting. Three go onto the bending lady.",
                    "image": "all pieces.png"
                },
                "they are sticky": {
                    "text": "Those \"puzzle\" pieces you found in the drawer won't fit together, but they are a lot stickier than you think!"
                }
            }
        },
        "2": {
            "Dildo Game": {
                "feel inside the hole": {
                    "text": "The gloryhole contains a wide selection of sizes and shapes! Feel them all, share your favorites, and then put the ones you found in the cabinet onto the top of the desk in the same order you felt them."
                }
            },
            "Spinning Lamp": {
                "spin the lamp": {
                    "text": "That funky lamp on the wall, weren't we messing with that last night?"
                }
            },
            "Case Code": {
                "deleted files": {
                    "text": "I think when I tried to use the computer I deleted a whole lot of files. I hope it wasn't anything important!"
                }
            },
            "Weight Game": {
                "notice their weight": {
                    "text": "This cocaine can't be the real deal. Are we sure they're not fake? Feel how light some of them are!"
                },
                "organize by weight": {
                    "text": "Surely at least one of the blocks of cocaine they sold the batch with would be real.. Organize them by weight on that corner table over there and we'll figure this out."
                }
            },
            "Buzzwire": {
                "operation": {
                    "text": "Ever played \"Operation\"? Keep the buzzer away from the metal pipes and try to get it to the end. If the light turns red you must go all the way back to restart it."
                },
                "fast then slow": {
                    "text": "The system resets every five seconds. You can make four errors before the alarm goes off. Go fast and hard but stop just before it alarms and just wait five seconds to refresh your chances."
                }
            },
            "Sliding Shelf": {
                "need trophies": {
                    "text": "That shelf is going to need three naughty trophies placed upon it before you find this vault."
                }
            },
            "Memory Hotel": {
                "in order": {
                    "text": "As the story is being told, one light will turn on per location. Watch for them. They must be pressed in order, and ensure that when you hold the button down, it turns red before you proceed."
                }
            },
            "Drawers": {
                "line it up": {
                    "text": "The drawers have numbers on their fronts. There are also numbers inside. It's a giant combination lock: line up the drawers inner numbers according to their top outer numbers."
                }
            }
        },
        "4": {
            "Tools": {
                "find them": {
                    "text": "You're looking for three hand tools in the room. You might want to open some drawers."
                },
                "infinity loop": {
                    "text": "The metal hoop on the wall has your key for the drawer. It's possible to pull it off with just a bit of creative rotation."
                }
            },
            "Bench Lights": {
                "timing": {
                    "text": "The lights moving across the back of the workbench correspond to small buttons on the sides. Look for an illuminated button and press and HOLD it when it reaches the red line. HOLD it while you do the same for the next three."
                }
            },
            "Motorcycle": {
                "three things": {
                    "text": "You need three components to get the bike started. A gas hose. A pair of jumper cables. And the antidote, before you leave, or this is all for nothing."
                }
            },
            "TV": {
                "license plate": {
                    "text": "The license plate on the wall there isn't quite like the rest. What is GTE when converted to numbers? Check where G, T, and E are on the keypad of the phone. The phone isn't plugged in though. Where would these numbers go?"
                }
            },
            "Zombie Loops": {
                "watch tv": {
                    "text": "The letters shown on the TV tell you which ZOMBIE chain to pull on the wall. Move fast and only pull the chain with the letter shown on the screen because they WON'T be in order."
                }
            },
            "Microwave": {
                "wheel": {
                    "text": "To open that microwave you're going to have to come back to that wheel you saw in the first room."
                }
            },
            "Breakers": {
                "tools": {
                    "text": "The toolbench has four rows of four tools, some missing, some not. Sixteen total.\n\nThe breaker box.. how many switches does it have?",
                    "image": "breaker box.png"
                }
            },
            "Wagon Wheel": {
                "trial and error": {
                    "text": "The wheel is a trial and error puzzle, but the solution will always be the same. Try turning it left or right, but be slow and try to remember which directions worked each time."
                },
                "red hand red light": {
                    "text": "The bloody handprint on the wheel corresponds with the light on the wall. Line it up with the light to input a left or right turn into the sequence.",
                    "image": "wheel.png"
                }
            },
            "Cables Box": {
                "wrenches": {
                    "text": "Found a box of wrenches? They've all got numbers on them and it looks to me all the number wheels on that box have a differently sized bolt on the front.",
                    "image": "wrenches.png"
                },
                "how to open box": {
                    "text": "There's a wooden board available to you with holes in it. There's a shelf tucked away in a corner with a puzzle on it. Place the board on the puzzle and read the result. Rotate the board to get the next number.",
                    "image": "cheese board.png"
                }
            }
        },
        "5": {
            "Clock": {
                "trial and error": {
                    "text": "The clock is a trial and error puzzle, but the solution will always be the same. Try turning the red knob on the sun dial left or right, and try to remember which directions worked each time."
                }
            },
            "Sun Dial": {
                "trial and error": {
                    "text": "The clock is a trial and error puzzle, but the solution will always be the same. Try turning the red knob on the sun dial left or right, and try to remember which directions worked each time.",
                    "image": "sun dial.png"
                },
                "look at the clock": {
                    "text": "That big clock responds to LEFT and RIGHT turns of the sun dial in a SPECIFIC ORDER. Keep an eye on it as you turn the dial and try to remember the sequence until you get it right!",
                    "image": "sun dial.png"
                }
            },
            "Rope Braid": {
                "get the key down": {
                    "text": "There's a key at the top of those braided ropes. If you unbraid them a bit, I'm sure you could slide it down to the bottom."
                }
            },
            "Symbol Maze": {
                "trial and error": {
                    "text": "The goal of the block maze in the corner  of the room is to slide the pieces past the gate on the left. Don't be afraid to slide them around a lot. Keep trying until you get it right.",
                    "image": "symbol maze.png"
                }
            },
            "Yellow Puzzle": {
                "letters": {
                    "text": "The pieces you found in the suitcase fit onto the table, and you'll notice they have letters on them too! If you try to fit the words together, so will the puzzle too!",
                    "image": "table 1.png"
                }
            },
            "Family Portrait": {
                "slide it up": {
                    "text": "The family portrait does belong in that cabinet and it will fit right in that rectangular slot. Hold it up in there firmly.",
                    "image": "family cabinet.png"
                }
            },
            "Mirror": {
                "instruments": {
                    "text": "The mirror is telling you a sequence of instruments. Look at those instruments closely and find out why they're so important!"
                }
            },
            "Mouth Cabinet": {
                "portraits inside": {
                    "text": "Reach your hand inside the terrifying mouthes and you should find some pleasant family photos. How nice."
                }
            },
            "Candles": {
                "3 light 3 dark": {
                    "text": "That burnt sheet on the table next to the candles will tell you how many candles should be lit and how many should be BLOWN out."
                },
                "if they still don't get it": {
                    "text": "Three candles must be colored the three colors you've found in the room. Blue (instruments), Yellow (the table), and Pink (the cross). Three candles must be dark. Blow HARD on the candles until they match."
                }
            },
            "Suitcase": {
                "rope to open": {
                    "text": "To get that suitcase open you have to complete something else in the room. Start with that braided rope there. That should be easy.",
                    "image": "suitcase.png"
                }
            },
            "Vanity Photos": {
                "threadboard": {
                    "text": "Have you found a black and white square with rope in it? What about a door with letters on both sides? If you follow the rope's path and match it to the door, you'll get names!",
                    "image": "thread.png"
                }
            },
            "Diary/Cross": {
                "put it in": {
                    "text": "The diary belongs inside the drawers under the curtains. Open the drawer, put the book inside, and close it. If the spirits accept the offering, perhaps they'll give you something in return. Look inside again."
                }
            }
        },
        "6": {
            "Color Buttons": {
                "look above door": {
                    "text": "The buttons correspond to the colors above the door. It's a race against time!",
                    "image": "victjory.png"
                }
            },
            "Door": {
                "hold all symbols": {
                    "text": "All four symbols must be held at the same time."
                }
            },
            "Levers": {
                "instructions": {
                    "text": "Each stack of blocks and their symbols can add together to create one of the symbols below. Only one side of each block matters. The 4th block is done for you."
                },
                "solution": {
                    "text": "This is the orientation of the levers you must move them to to complete the puzzle",
                    "image": "levers.png"
                }
            },
            "Stone Fragments": {
                "gather all pieces": {
                    "text": "All pieces must be placed together on the box to open it. If you're missing any, you've got more puzzles to solve.",
                    "image": "tangram.png"
                }
            },
            "Floor Panels": {
                "one at a time": {
                    "text": "The panels on the floor must be stepped on in ORDER, one at a time! Be quick and use only one person."
                }
            },
            "Light Maze": {
                "not white path": {
                    "text": "The tip of the crystal must touch the SYMBOL, not the white path. Check the crystal for a map on where to go.",
                    "image": "light maze.png"
                }
            },
            "Pickaxes": {
                "feel for symbols": {
                    "text": "The pickaxe holder has a slot at the bottom. If you feel up inside of it with your fingers, you will feel symbols that match what is drawn on the pickaxes."
                }
            },
            "Laser Crown": {
                "point at poseidon": {
                    "text": "The pyramid is emitting a laser from the top! The mirror you have can redirect the laser into the statue's crown. Hold it there for a few seconds.",
                    "image": "poseidon.png"
                }
            },
            "Pyramid": {
                "trophies": {
                    "text": "The clear trophies must be placed on all four pillars of the pyramid"
                }
            },
            "Dynamite": {
                "order": {
                    "text": "The dynamite sticks came in a box with instructions. Follow these instructions, placing all of the sticks inside the 9 holes. Press the plunger on top of the box when you're done!"
                }
            },
            "Trident": {
                "put that thing back where it came from or so help me": {
                    "text": "The trident that you found goes next to the other one in the room. Slide it in to complete Poseidon's quest."
                }
            },
            "Cryptex Chest": {
                "use octopus": {
                    "text": "The wheels on the chest correspond to symbols found from those circles on the wall. Move the octopus until it sticks and your symbol will be found.",
                    "image": "cryptex.png"
                },
                "line it up properly": {
                    "text": "The golden trapezoids in the spinning wheel chest show how the wheels must be lined up. Be precise and point the symbols straight up!"
                }
            },
            "Harp Lights": {
                "look next to the door": {
                    "text": "There are red lights next to the door. Move your hand through them."
                },
                "play them in order": {
                    "text": "To play the harp properly, put your hand through the first laser at the bottom, and then move it up through each laser one at a time until you reach the top. (It will make the same sound you've been hearing!)"
                }
            }
        },
        "7": {
            "Clock": {
                "goggles tv": {
                    "text": "That clock on the side of the time machine must be set to the time of day shown on the screen on the desk. You must need some sort of lens to look through to see the screen though."
                }
            },
            "Professor Doors": {
                "close them": {
                    "text": "The professor told us we have to close the doors on the corpse before we move forward."
                }
            },
            "Ignition": {
                "timing": {
                    "text": "The ignition coils must fire at a precise timing to lock in. The green sections indicate proper ignition timing for each coil. Press the button and press it again when the coil fills up to the green line."
                }
            },
            "Skull Button": {
                "look inside skull": {
                    "text": "That skull is more than decoration. I hope you're not afraid to get your fingers bitten off, because you'll need to hold them down in there for a couple seconds."
                }
            },
            "Footprints": {
                "all four": {
                    "text": "All four footprints must be held down simultaneously to wake up the calculometer's power supply matrix."
                }
            },
            "Liquid Cylinders": {
                "pig": {
                    "text": "The liquid cylinders have a three letter lock on their drain sequence. \n\nThe vision portal on the bookshelf shows an animal when the button inside the skull is held down. It's a pig."
                }
            },
            "Wall Valves": {
                "numbers and cylinders": {
                    "text": "Each valve wheel has a number near it. 1, 2, 3, and 4. Ignore 5.\n\nThe four liquid cylinders contain numbers that correspond to each valve. The one on the left is #1. Rotate the valves until they match."
                }
            },
            "Desk Fan": {
                "rotate until readable": {
                    "text": "Rotate the knob on the fan in the same direction as the arrow around it. Keep rotating until something happens to the fan blades inside."
                }
            },
            "Inverse Vault": {
                "trial and error": {
                    "text": "Press the buttons on the keypad while looking through the peephole on the front of the desk. Press them all and find the sequence that matches the 4 digit number found on the fan."
                }
            },
            "Desk Ball": {
                "skull ball drop in desk": {
                    "text": "Have the ball from the skull? Drop it into the DESK and use the tool found in the left drawer to move it around the course."
                }
            }
        },
        "3": {
            "Mirror": {
                "mirror has symbols": {
                    "text": "Look at the mirror next to the fireplace. It has the same symbols!"
                }
            },
            "Spin Globe": {
                "spinning activates podium": {
                    "text": "Look at the \"Galaxy Podium\" while you spin the globe. The symbols shown there are somewhere else in the room.",
                    "image": "galaxy GLOBE.png"
                }
            },
            "Veiny Orb": {
                "tap it": {
                    "text": "Tap the circle on the side of the white orb's stand. It will show you three colors in order important for another puzzle.",
                    "image": "veiny orb.png"
                }
            },
            "Knocking Chest": {
                "book": {
                    "text": "There's a book on the wall that looks nothing like the rest. Press it and you will hear a pattern.\n\nSure sounds a lot like knocking.",
                    "image": "knock book.png"
                },
                "knock on the chest": {
                    "text": "The book on the wall behind the wands, when pressed, plays a pattern of sounds. Knock the same pattern on the knocking chest to open it.",
                    "image": "knocking chest.png"
                },
                "knocking pattern for the hearing impaired": {
                    "text": "Knock firmly on the center of the chest. Knock pattern 1,2,1"
                }
            },
            "Spell Chart": {
                "smell the bottles": {
                    "text": "The bottles above the fireplace seem to have a smell! And they've got symbols on them that match that spell chart on the wall."
                },
                "scroll on desk": {
                    "text": "The bottles smell like the scent described on the scroll on the desk. Those bottles have symbols on them that should be tapped on the spell chart in the same order with your wand."
                }
            },
            "Chair": {
                "sit on it": {
                    "text": "I know we're all excited to complete our quest, but I think the best thing to do would be to SIT and think about the plan."
                }
            },
            "Rod Game": {
                "put rods here": {
                    "text": "There are three square brown rods which fit within holes in the side of the bed.",
                    "image": "rod holes.png"
                },
                "how to align": {
                    "text": "Set the rods from left to right to the colors of the crystal ball. Make sure the end with the yellow symbol is visible and the lines are facing up"
                },
                "rod solution": {
                    "text": "Insert the blank end of the rod first into the bed then starting by the wall align them red, blue, green to the opening. the lines should be facing up"
                }
            },
            "Fireplace": {
                "solution": {
                    "text": "Hold down these four symbols with your wand until the fireplace spell is complete.",
                    "image": "fireplace solution.png"
                }
            },
            "Code Panel": {
                "place planchette here": {
                    "text": "Place the item you found inside the book on the center symbol on the table glyphs with the arrow pointing north.",
                    "image": "center of table.png"
                },
                "code panel location": {
                    "text": "When you sit down at my chair, look to your bottom right on the desk. You'll see a grid of symbols along with a set of buttons."
                },
                "connect the symbols": {
                    "text": "The keypad corresponds to the table of symbols. Press the buttons according to where the planchette moves."
                }
            },
            "Magic Shelf": {
                "need these items": {
                    "text": "To complete the shelf, you'll need three items. A goblet of ice, a chalice of dragon's eye, and a crystal skull.",
                    "image": "ice green skull.png"
                }
            },
            "Potion Pot": {
                "look under bed": {
                    "text": "The last place I had my recipe book, I recall laying in that wooden bed there. Perhaps you should do the same!"
                }
            },
            "Fart Owl": {
                "trial and error": {
                    "text": "Archimedes' puzzle is of trial and error. Place your hand on the side of the owl's log. Hoots are good, farts are bad. Remember what order made the hoots. If you got a fart, start over.",
                    "image": "owl hand.png"
                },
                "full hoot pattern": {
                    "text": "Owl tap pattern:\n2 left\n2 right\n1 left\n1 right"
                }
            },
            "Planet Colors": {
                "look at the ornament": {
                    "text": "The ornament on the shelf will indicate to you two things for the planetary puzzle on the wall. Size and color. Match the sizes to their colors using your wand and the box will open for you.",
                    "image": "planets.png"
                },
                "circles are planets": {
                    "text": "Those colored circles on the wall represent the planets, use your wands on the circles to change their colors."
                },
                "planet color solution": {
                    "text": "From top to bottom, the planet circles should be: cyan, red, blue, green, purple, yellow, orange."
                }
            },
            "Stone Pieces": {
                "rotation matters": {
                    "text": "Ensure that all the black stone pieces on the desk are rotated to complete the picture of the potion bottle."
                }
            },
            "Goblet Chest": {
                "learn the taps": {
                    "text": "Discover the correct pattern of left and right taps for my owl. A hoot is correct, a toot is not and you'll have to start over."
                }
            }
        }
    }
}